OpenFOAM/OpenFOAM-7/tutorials/incompressible/pimpleFoam/RAS/wingMotion/wingMotion2D_simpleFoam/0/include/frontBackTopBottomPatches
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

topAndBottom
{
    type slip;
}

front
{
    type empty;
}

back
{
    type empty;
}

// ************************************************************************* //
